[
  {
    "title": "Constraints",
    "id": 1,
    "notes": ["Constraints derived from different factors."],
    "children": [  
      {
      "title": "Law-based Constraints",
      "id": 1,
      "notes": ["Constraints derived from empirical laws that dictate limits based on natural laws."],
      "children": [
        {
          "title": "Body Size Constraints in Animals",
          "id": 4,
          "notes": ["Limited by the square-cube law, law of gravity, and musculoskeletal strength, determining the maximum and minimum size of an animal."]
        }
      ]
    },
    {
      "title": "Mathematical Constraints",
      "id": 2,
      "notes": ["Constraints based on mathematical properties or principles."],
      "children": [
        {
          "title": "Königsberg Bridge Problem",
          "id": 5,
          "notes": ["Topological features of the bridge system constrain the available walking paths, making certain routes impossible."]
        }
      ]
    },
    {
      "title": "Causal Constraints",
      "id": 3,
      "notes": ["Constraints that are causal in nature, structuring and limiting the outcomes of a process."],
      "children": [
        {
          "title": "Spatial Location Constraints",
          "id": 6,
          "notes": ["Examples include riverbanks guiding rivers, and roadways constraining traffic movement."]
        },
        {
          "title": "Constitutional Changes Constraints",
          "id": 7,
          "notes": ["Guiding changes in the makeup or constitution of an entity over time, such as metabolic pathways in biology."]
        },
        {
          "title": "Physical Structure Constraints",
          "id": 8,
          "notes": ["Physical barriers such as blood vessels, nerve tracts, and lymph vessels guiding or restricting the flow of biological processes."]
        },
        {
          "title": "Large-Scale Social Forces",
          "id": 9,
          "notes": ["Structural causes in sociology and politics, such as poverty, racism, and gender inequality, limiting behaviors and decisions of individuals."]
        },
        {
          "title": "Anatomic Barriers in Medical Context",
          "id": 10,
          "notes": ["Physical entities like tumors, vascular routes, and tissue malformations influencing medical outcomes through larger-scale physical forces."]
        }
      ]
    }
  ]
}
]
